# 企业股权图谱系统构建初步方案
-
根据企业股权结构相关的数据，构建一个企业股权图谱系统，以满足基于企业股权关系分析的需求，如关系的查询（通常涉及到多跳）、挖掘等。
## 环境配置
> 图数据库： Neo4j 4.4.5
> 
> 开发工具：Python 3.8 依赖库：pandas     
  
## 数据准备
**法人&公司的数据**
> 
1. 公司与子公司之间的关系数据
2. 公司持有公司的股份数据
3. 法人任职公司数据
4. 法人持有公司股份数据
5. 法人之间亲密度的关系数据
6. ......

## 图数据建模（本体构建/图谱Schema设计）
在图数据库中建模的方式，主要涉及到实体、关系、实体及关系所具有的属性：

**实体**
> 
*	人
* 公司

**关系**
> 
*  人 - 相关关系 - > 人
*  人 - 任职 - > 公司
*  人/公司 - 持有股份 - > 公司
*  公司 - 作为子公司 - > 公司

**属性**
> 
**> 实体属性：**
> 
* 人的属性：姓名、年龄、...
* 公司的属性：公司名称、公司地址、...
> 
**> 关系属性：**
> 
* 持有股份 这个关系有属性：份额、...
* 任职 这个关系有属性：职位、职级、...
* 其他关系属性...

将以上实体、关系、属性通过图形展示如下所示：

![](/Users/amyqian/Documents/海捷科技 - 2021/p10.中信登-风控/03. demo/shareholding_example/images/model.png)
## 图数据入库
**> 知识抽取**
> 
根据以上所构建的图谱Schema，将源数据进行相应的数据处理

**> 知识存储**
> 
将处理好的数据导入到图数据库Neo4j中

## 图库中查询数据
**知识查询**

根据以上所构建好的股权关系图谱，可通过图数据库进行股权穿透关系的查询，如查询一个公司的三跳以内的股权穿透：


> 		# 公司名称为Hall LLC		
> 		MATCH p=(:Corp {name:"Hall LLC"})-[*..3]-() RETURN p LIMIT 100


![](/Users/amyqian/Documents/海捷科技 - 2021/p10.中信登-风控/03. demo/shareholding_example/images/res.jpg)


## 图谱系统构建
在此基础之上，可以构建一个提供给终端用户来使用的股权查询系统。需要自己去实现界面、或者封装出一个API给上游（多端）提供图谱查询的功能。

**系统架构设计**

* 前端：接受用户要查询的穿透法人、公司，按需发请求给后端，并用 D3.js 将返回结果渲染为关系图；
* 后端：接受前端的 API 请求，将请求转换为 Graph DB 的查询，并返回前端期待的结果。

```ascii
  ┌───────────────┬───────────────┐
  │               │  Frontend     │
  │               │               │
  │    ┌──────────▼──────────┐    │
  │    │ Vue.JS              │    │
  │    │ D3.JS               │    │
  │    └──────────┬──────────┘    │
  │               │  Backend      │
  │    ┌──────────┴──────────┐    │
  │    │                     │    │
  │    | Neo4j-Java          │    │
  │    └──────────┬──────────┘    │
  │               │  Graph Query  │
  │    ┌──────────▼──────────┐    │
  │    │ Graph Database      │    │
  │    └─────────────────────┘    │
  │                               │
  └───────────────────────────────┘
```


**最终效果呈现**

在系统前端接受一个用户输入的实体的ID，再回车之后：

* 前端程序把请求发给后端；
* 后端拼接 Neo4j Graph 的查询语句，通过 Neo4j Java客户端请求 Neo4j Graph；
* Neo4j  Graph 接受请求做出穿透查询，返回结构给后端；
* 后端将结果构建成前端 D3 接受的格式，传给前端；
* 前端接收到图结构的数据，渲染股权穿透的数据关系图。

